export const metadata = {   
    home: {
        title: 'Главная страница - Микровидеохостинг',
        description: 'Тестовое веб-решение для видеохостинга на фреймворке Next.js',
        author: 'Иван Орловский',
        keywords: 'микровидеохостинг, видеохостинг, веб-приложение, видео',
        language: 'ru-RU',
    },

    tags: {
        title: 'Теги - Микровидеохостинг',
        description: 'Список существующих тегов для видео',
        author: 'Иван Орловский',
        keywords: 'микровидеохостинг, видеохостинг, теги, видео',
        language: 'ru-RU',
    },

    upload: {
        title: 'Видео - Микровидеохостинг',
        description: 'Описание для страницы с тегами',
        author: 'Иван Орловский',
        keywords: 'микровидеохостинг, видеохостинг, теги, веб-приложение',
        language: 'ru-RU',
    },

    watch: {
        //метаданные для страницы просмотра видео
        //берутся из базы данных
        language: 'ru-RU'
    },

    related: {
        //метаданные для страницы видео по тегу
        //берутся из базы данных
        language: 'ru-RU'
    }
  };